package ru.academy.hackathon.data

class FantData {

    val streetsFants = listOf(
        "Поздравлять каждого прохожего с праздником, желая всего наилучшего",
        "Загадать кому-нибудь из случайных людей трудную загадку",
        "Стать инициатором хоровода вокруг дерева",
        "Встать под деревом и поздравить людей с праздником по-президентски",
        "Выпить шампанского с понравившимся прохожим",
        "Дарить бенгальские огни незнакомцам, обнимая каждого из них",
        "Приставать к людям, предлагая погадать по руке",
        "Завязать знакомство с 5 мужчинами и женщинами",
        "Угощать печеньем всех встречающихся малышей",
        "Получить 10 комплиментов от 5 людей противоположного пола",
        "Раздеться до белья, выбежать во двор и попросить у первого встречного соль",
        "Накрасить помадой нос и сыграть Деда Мороза",
        "Зайти к каждому соседу и поздравить с праздником",
        "Притвориться иностранным гражданином и пытаться узнать дорогу к посольству у проходящих мимо людей",
        "Броситься на шею прохожему, а потом притвориться, что обознался",
        "Опросить прохожих, интересуясь их мечтами и планами на следующий год",
        "Попросить у 5 людей противоположного пола номер телефона"
    )

    val sportsFants = listOf(
        "Отжаться 15 раз",
        "Присесть 30 раз",
        "Встать на руки",
        "Изобразить как играет футболист",
        "Изобразить как играет баскетболист",
        "Изобразить как играет хоккеист ",
        "Изобразить празднование гола в футболе",
        "Изобразить празднование гола в баскетболе",
        "Изобразить празднование гола в хоккеи",
        "Оббежать вокруг стола 10 раз",
        "Сделать гимнастическую фигуру мостик",
        "Сделать гимнастическую фигуру ласточку",
        "Подпрыгнуть на одной ноге 50 раз"
    )

    val childFants = listOf(
        "Рассказать стих",
        "Спеть песню",
        "Нарисовать портрет кого-либо из участников",
        "С завязанными глазами, не помогая себе руками, ртом взять кусочек фрукта с блюда и отгадать, что это",
        "Изобразить котенка, который лакает молочко из тарелки",
        "Из бумаги как можно быстрее сложить какой-либо предмет",
        "С завязанными глазами нарисовать домашнее животное",
        "С закрытыми глазами определить на ощупь, какой предмет ведущий положил в руку",
        "Станцевать с полным стаканом воды в руке",
        "Вспомнить как можно больше вежливых слов",
        "Поменять обувь с левой ноги на правую, пройти в таком виде красивой походкой",
        "Показать так персонажа мультфильма, чтобы все игроки угадали, кто это",
        "Успеть выпить напиток из стакана за 15 секунд через трубочку",
        "Изобразить любую профессию так, чтобы другие смогли отгадать",
        "Назвать десять слов на одну букву.",
        "Побыть собачкой, вертеть хвостиком и выпрашивать еду (без слов)",
        "Набрать в рот воды и не отвечать на вопросы других участников 2 минуты.",
        "Съесть кусочек лимона и не скривиться при этом.",
        "Представить себя цаплей, стоять на одной ноге и попытаться при этом что-то съесть со стола не пользуясь руками.",
        "Представить, что вы робот и двигаться как он. Задавать вопросы голосом робота"
    )

    val alghogolFants = listOf(
        "Выпить бокал шампанского без помощи рук",
        "Сказать праздничный тост и выпить одну рюмку",
        "Выпить «на брудершафт» с соседом",
        "Сделайте каждому игроку алкогольный коктейль",
        "Выпей рюмку с закрытыми глазами",
        "Выпей рюмку за 5 глотков",
        "Выпей рюмку из рук соседа",
        "Выпей рюмку без помощи рук",
        "Сделай коктейль из всех напитков и выпей его",
        "Выпей рюмку под столом",
        "Выпей, стоя в позе ласточки",
        "Выпей лежа на полу или на диване",
        "Разрекламировать выпиваемый напиток",
        "Придумай 20 хвалебных описаний выпитой рюмке (содержимому)",
        "Сделай рюмку из яблока или мандарина и угости каждого присутствующего из нее.",
        "Выйди в подъезд и выпей в нем с первым попавшимся",
        "Выпей из туфельки соседки по столу",
        "Вылей рюмку в тарелку и выпей  с помощью ложки",
        "Разлить всем в рюмки (бокалы) без рук",
        "Выпей рюмку через соломинку"
    )
}